#1970 쉬운 거스름돈 (D2)
test_case = int(input())

for i in range(test_case):
    money = int(input())
    a = money // 50000 # 50000으로 나눈 몫
    b = (money % 50000) // 10000 # 50000으로 나눈 나머지를 10000으로 나눈 몫
    c = (money % 50000 % 10000) // 5000
    d = (money % 50000 % 10000 % 5000) // 1000
    e = (money % 50000 % 10000 % 5000 % 1000) // 500
    f = (money % 50000 % 10000 % 5000 % 1000 % 500) // 100
    g = (money % 50000 % 10000 % 5000 % 1000 % 500 % 100) // 50
    h = (money % 50000 % 10000 % 5000 % 1000 % 500 % 100 % 50) // 10
    print(f'#{i+1}')
    print(a, b, c, d, e, f, g, h)